; domain
(define (domain EmergencyServiceLogisticDomain)

(:requirements :strips :typing)

(:types
    Person
    Location
    Drone
    Box
    Supply

    Carrier
    Num
)

(:predicates
    (isPersonInLocation ?p - Person ?l - Location)
    (personHas ?p - Person ?s - Supply)
    
    (isDroneInLocation ?d - Drone ?l - Location)
    (isDroneFree ?d - Drone)
    (droneHasBox ?d - Drone ?b - Box)

    (boxContains ?b - Box ?s - Supply)
    (isBoxInLocation ?b - Box ?l - Location)

    (locationIsDeposit ?l - Location)

    (isNext ?n1 - Num ?n2 - Num)

    (carrierHasBoxes ?c - Carrier ?n - Num) ; How many boxes
    (isCarrierInLocation ?c - Carrier ?l - Location) ; Current Location
    (isBoxInCarrier ?c - Carrier ?b - Box)

)



(:action PickBox
    :parameters (?d - Drone ?b - Box ?l - Location)
    :precondition (and 
        (isDroneInLocation ?d ?l)
        (isBoxInLocation ?b ?l)
        (locationIsDeposit ?l)
        (isDroneFree ?d)
    )
    :effect (and 
        (not (isDroneFree ?d))
        (not (isBoxInLocation ?b ?l))
        (droneHasBox ?d ?b)
    )
)


(:action MoveDrone
    :parameters (?d - Drone ?from - Location ?to - Location)
    :precondition (and 
        (isDroneInLocation ?d ?from)
    )
    :effect (and 
        (not (isDroneInLocation ?d ?from))
        (isDroneInLocation ?d ?to)
    )
)


(:action DeliverBox
    :parameters (?d - Drone ?b - Box ?s - Supply ?p - Person ?l - Location)
    :precondition (and 
        (isDroneInLocation ?d ?l)
        (isPersonInLocation ?p ?l)

        (droneHasBox ?d ?b)
        (boxContains ?b ?s) 
    )
    :effect (and 
        (not (droneHasBox ?d ?b))

        (isDroneFree ?d)
        (personHas ?p ?s)
        (isBoxInLocation ?b ?l)

    )
)


(:action PutBoxOnCarrier
    :parameters (?d - Drone ?c - Carrier ?l - Location ?b - Box ?startNum - Num ?endNum - Num)
    :precondition (and 
        (isDroneInLocation ?d ?l)
        (isCarrierInLocation ?c ?l)
        (locationIsDeposit ?l)

        (droneHasBox ?d ?b)
        (carrierHasBoxes ?c ?startNum)
        (isNext ?startNum ?endNum)
    )
    :effect (and 
        (not (droneHasBox ?d ?b))
        (isDroneFree ?d)

        (not (carrierHasBoxes ?c ?startNum))
        (carrierHasBoxes ?c ?endNum)
        (isBoxInCarrier ?c ?b)
    )
)


(:action MoveCarrier
    :parameters (?d - Drone ?c - Carrier ?from - Location ?to - Location)
    :precondition (and 
        (isDroneInLocation ?d ?from)
        (isCarrierInLocation ?c ?from)
        (isDroneFree ?d)
    )
    :effect (and 
        (not (isDroneInLocation ?d ?from))
        (not (isCarrierInLocation ?c ?from))

        (isDroneInLocation ?d ?to)
        (isCarrierInLocation ?c ?to)
    )
)


(:action PickBoxFromCarrier
    :parameters (?d - Drone ?c - Carrier ?l - Location ?b - Box ?startNum - Num ?endNum - Num)
    :precondition (and 
        (isDroneInLocation ?d ?l)
        (isCarrierInLocation ?c ?l)
        (isBoxInCarrier ?c ?b)

        (isDroneFree ?d)
        (carrierHasBoxes ?c ?startNum)
        (isNext ?endNum ?startNum)
    )
    :effect (and 
        (not (isDroneFree ?d))
        (droneHasBox ?d ?b)

        (not (carrierHasBoxes ?c ?startNum))
        (not (isBoxInCarrier ?c ?b))
        (carrierHasBoxes ?c ?endNum)

    )
)

)

; problem
(define (problem drone_problem_d1_r1_l5_p5_c5_g5_ct2)
(:domain EmergencyServiceLogisticDomain)
(:objects
	drone1 - Drone
	depot - Location
	loc1 - Location
	loc2 - Location
	loc3 - Location
	loc4 - Location
	loc5 - Location
	crate1 - Box
	crate2 - Box
	crate3 - Box
	crate4 - Box
	crate5 - Box
	food - Supply
	medicine - Supply
	person1 - Person
	person2 - Person
	person3 - Person
	person4 - Person
	person5 - Person
	carrier1 - Carrier
	num0 - Num
	num1 - Num
	num2 - Num
	num3 - Num
	num4 - Num
)
(:init
(isPersonInLocation person1 loc1)
(isPersonInLocation person2 loc4)
(isPersonInLocation person3 loc1)
(isPersonInLocation person4 loc5)
(isPersonInLocation person5 loc4)

(personHas person2 food)
(personHas person2 medicine)
(personHas person3 medicine)
(personHas person4 medicine)
(personHas person5 medicine)

(isDroneInLocation drone1 depot)
(isDroneFree drone1)

(boxContains crate1 food)
(boxContains crate2 food)
(boxContains crate3 food)
(boxContains crate4 food)
(boxContains crate5 medicine)

(isBoxInLocation crate1 depot)
(isBoxInLocation crate2 depot)
(isBoxInLocation crate3 depot)
(isBoxInLocation crate4 depot)
(isBoxInLocation crate5 depot)

(locationIsDeposit depot)
(isNext num0 num1)
(isNext num1 num2)
(isNext num2 num3)
(isNext num3 num4)
(isCarrierInLocation carrier1 depot)
(carrierHasBoxes carrier1 num0)
)
(:goal (and
(isDroneInLocation drone1 depot)

(personHas person1 food)
(personHas person1 medicine)
(personHas person3 food)
(personHas person4 food)
(personHas person5 food)

	))
)

; plan
1. (pickbox drone1 crate1 depot)
   deleted: (isdronefree drone1) (isboxinlocation crate1 depot)
   added: (dronehasbox drone1 crate1)
   goals met: 1 of 6
2. (movedrone drone1 depot loc1)
   deleted: (isdroneinlocation drone1 depot)
   added: (isdroneinlocation drone1 loc1)
   goals met: 0 of 6
3. (deliverbox drone1 crate1 food person1 loc1)
   deleted: (dronehasbox drone1 crate1)
   added: (isdronefree drone1) (personhas person1 food) (isboxinlocation crate1 loc1)
   goals met: 1 of 6
4. (movedrone drone1 loc1 depot)
   deleted: (isdroneinlocation drone1 loc1)
   added: (isdroneinlocation drone1 depot)
   goals met: 2 of 6
5. (pickbox drone1 crate5 depot)
   deleted: (isdronefree drone1) (isboxinlocation crate5 depot)
   added: (dronehasbox drone1 crate5)
   goals met: 2 of 6
6. (movedrone drone1 depot loc1)
   deleted: (isdroneinlocation drone1 depot)
   added: (isdroneinlocation drone1 loc1)
   goals met: 1 of 6
7. (deliverbox drone1 crate5 medicine person1 loc1)
   deleted: (dronehasbox drone1 crate5)
   added: (isdronefree drone1) (personhas person1 medicine) (isboxinlocation crate5 loc1)
   goals met: 2 of 6
8. (movedrone drone1 loc1 depot)
   deleted: (isdroneinlocation drone1 loc1)
   added: (isdroneinlocation drone1 depot)
   goals met: 3 of 6
9. (pickbox drone1 crate2 depot)
   deleted: (isdronefree drone1) (isboxinlocation crate2 depot)
   added: (dronehasbox drone1 crate2)
   goals met: 3 of 6
10. (movedrone drone1 depot loc1)
   deleted: (isdroneinlocation drone1 depot)
   added: (isdroneinlocation drone1 loc1)
   goals met: 2 of 6
11. (deliverbox drone1 crate2 food person3 loc1)
   deleted: (dronehasbox drone1 crate2)
   added: (isdronefree drone1) (personhas person3 food) (isboxinlocation crate2 loc1)
   goals met: 3 of 6
12. (movedrone drone1 loc1 depot)
   deleted: (isdroneinlocation drone1 loc1)
   added: (isdroneinlocation drone1 depot)
   goals met: 4 of 6
13. (pickbox drone1 crate3 depot)
   deleted: (isdronefree drone1) (isboxinlocation crate3 depot)
   added: (dronehasbox drone1 crate3)
   goals met: 4 of 6
14. (movedrone drone1 depot loc4)
   deleted: (isdroneinlocation drone1 depot)
   added: (isdroneinlocation drone1 loc4)
   goals met: 3 of 6
15. (deliverbox drone1 crate3 food person5 loc4)
   deleted: (dronehasbox drone1 crate3)
   added: (isdronefree drone1) (personhas person5 food) (isboxinlocation crate3 loc4)
   goals met: 4 of 6
16. (movedrone drone1 loc4 depot)
   deleted: (isdroneinlocation drone1 loc4)
   added: (isdroneinlocation drone1 depot)
   goals met: 5 of 6
17. (pickbox drone1 crate4 depot)
   deleted: (isdronefree drone1) (isboxinlocation crate4 depot)
   added: (dronehasbox drone1 crate4)
   goals met: 5 of 6
18. (movedrone drone1 depot loc5)
   deleted: (isdroneinlocation drone1 depot)
   added: (isdroneinlocation drone1 loc5)
   goals met: 4 of 6
19. (deliverbox drone1 crate4 food person4 loc5)
   deleted: (dronehasbox drone1 crate4)
   added: (isdronefree drone1) (personhas person4 food) (isboxinlocation crate4 loc5)
   goals met: 5 of 6
20. (movedrone drone1 loc5 depot)
   deleted: (isdroneinlocation drone1 loc5)
   added: (isdroneinlocation drone1 depot)
   goals met: 6 of 6
